Ran Plan for 3 projects:

1. dir: `data-science/us-east-1/genai-llm-rag-bedrock-full` workspace: `default`
1. dir: `data-science/us-east-1/genai-llm-rag-bedrock-poc` workspace: `default`
1. dir: `shared/us-east-1/container-registry` workspace: `default`
---

### 1. dir: `data-science/us-east-1/genai-llm-rag-bedrock-full` workspace: `default`
<details><summary>Show Output</summary>

```diff
[22:05:49.040] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[22:05:49.058] INFO     ✔ OK                                                    
                                                                                
data.terraform_remote_state.ssl_cert: Reading...
data.terraform_remote_state.shared-dns: Reading...
data.terraform_remote_state.ssl_cert: Read complete after 0s
data.terraform_remote_state.shared-dns: Read complete after 0s
data.terraform_remote_state.vpc: Reading...
data.terraform_remote_state.vpc: Read complete after 0s
module.ecr_lifecycle_rule_default_policy_bycount.data.template_file.lifecycle_policy_imageCountMoreThan_untagged_or_any[0]: Reading...
module.ecr_lifecycle_rule_default_policy_bycount.data.template_file.lifecycle_policy_imageCountMoreThan_untagged_or_any[0]: Read complete after 0s [id=ef4a9107bd2316a4816fb9e662bbbba1eeb72fbb49fb3124b222343b20996765]
module.ecs_service.data.aws_subnet.this[0]: Reading...
module.iam_assumable_role_ecs_opensearch.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
module.iam_assumable_role_ecs_opensearch.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecr_repositories.data.aws_partition.current: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=905418344519]
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=905418344519]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecr_repositories.data.aws_caller_identity.current: Reading...
module.ecr_repositories.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=635943167]
module.iam_assumable_role_ecs_opensearch.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_partition.current: Reading...
module.alb.data.aws_partition.current: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks[0]: Read complete after 0s [id=2139823801]
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.iam_assumable_role_ecs_opensearch.data.aws_caller_identity.current: Read complete after 0s [id=905418344519]
module.ecr_repositories.data.aws_caller_identity.current: Read complete after 0s [id=905418344519]
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 1s [id=2291109037]
module.ecr_repositories.data.aws_iam_policy_document.repository[0]: Reading...
module.ecs_service.data.aws_subnet.this[0]: Read complete after 1s [id=subnet-0ae4e4874034d9346]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecr_repositories.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=942915339]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3497006181]
module.ecs_service.module.container_definition["demo"].data.aws_region.current: Reading...
module.ecs_service.module.container_definition["demo"].data.aws_region.current: Read complete after 0s [id=us-east-1]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # aws_iam_openid_connect_provider.aws_github_oidc will be created
  + resource "aws_iam_openid_connect_provider" "aws_github_oidc" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
          + "f879abce0008e4eb126e0097e46620f5aaae26ad",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_policy.ecs_opensearch_access will be created
  + resource "aws_iam_policy" "ecs_opensearch_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allow ECS to access Opensearch"
      + id               = (known after apply)
      + name             = "ecs_opensearch_access"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_policy.github_actions_oidc will be created
  + resource "aws_iam_policy" "github_actions_oidc" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Github OIDC integration for Github Actions"
      + id               = (known after apply)
      + name             = "bb-data-science-genai-llm-rag-bedrock-github-actions-oidc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "data-science"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "data-science"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
    }

  # aws_iam_role.github_actions_role will be created
  + resource "aws_iam_role" "github_actions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Github OIDC integration for Github Actions"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bb-data-science-genai-llm-rag-bedrock-github-actions-oidc"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "data-science"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "data-science"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.github_actions_oidc will be created
  + resource "aws_iam_role_policy_attachment" "github_actions_oidc" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bb-data-science-genai-llm-rag-bedrock-github-actions-oidc"
    }

  # aws_opensearchserverless_access_policy.this will be created
  + resource "aws_opensearchserverless_access_policy" "this" {
      + description    = "Amazon Bedrock Knowledge base."
      + id             = (known after apply)
      + name           = "bedrock-knowledge-base"
      + policy         = (known after apply)
      + policy_version = (known after apply)
      + type           = "data"
    }

  # aws_opensearchserverless_collection.this will be created
  + resource "aws_opensearchserverless_collection" "this" {
      + arn                 = (known after apply)
      + collection_endpoint = (known after apply)
      + dashboard_endpoint  = (known after apply)
      + description         = "Amazon Bedrock Knowledge base."
      + id                  = (known after apply)
      + kms_key_arn         = (known after apply)
      + name                = "bedrock-knowledge-base"
      + standby_replicas    = "ENABLED"
      + tags                = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all            = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + type                = "VECTORSEARCH"
    }

  # aws_opensearchserverless_security_policy.encryption will be created
  + resource "aws_opensearchserverless_security_policy" "encryption" {
      + description    = "Amazon Bedrock Knowledge base."
      + id             = (known after apply)
      + name           = "bedrock-knowledge-base"
      + policy         = jsonencode(
            {
              + AWSOwnedKey = true
              + Rules       = [
                  + {
                      + Resource     = [
                          + "collection/bedrock-knowledge-base",
                        ]
                      + ResourceType = "collection"
                    },
                ]
            }
        )
      + policy_version = (known after apply)
      + type           = "encryption"
    }

  # aws_opensearchserverless_security_policy.network will be created
  + resource "aws_opensearchserverless_security_policy" "network" {
      + id             = (known after apply)
      + name           = "bedrock-knowledge-base"
      + policy         = jsonencode(
            [
              + {
                  + AllowFromPublic = true
                  + Rules           = [
                      + {
                          + Resource     = [
                              + "collection/bedrock-knowledge-base",
                            ]
                          + ResourceType = "collection"
                        },
                      + {
                          + Resource     = [
                              + "collection/bedrock-knowledge-base",
                            ]
                          + ResourceType = "dashboard"
                        },
                    ]
                },
            ]
        )
      + policy_version = (known after apply)
      + type           = "network"
    }

  # aws_route53_record.priv_app_aws will be created
  + resource "aws_route53_record" "priv_app_aws" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "demo-genai.binbash.co"
      + type            = "A"
      + zone_id         = "Z07094013VFYCFPMVTXMM"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # aws_security_group.this will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow Inbound HTTPS Traffic"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "opensearch-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-01e178fdba62c75fb"
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "bb-data-science-genai-llm"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0a966549cc7baeb8a",
          + "subnet-0eca343a6aadc25c0",
        ]
      + tags                                                         = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # module.alb.aws_lb_listener.this["http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = (known after apply)
      + tags                                                                  = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order = (known after apply)
          + type  = "redirect"

          + redirect {
              + host        = "#{host}"
              + path        = "/#{path}"
              + port        = "443"
              + protocol    = "HTTPS"
              + query       = "#{query}"
              + status_code = "HTTP_301"
            }
        }
    }

  # module.alb.aws_lb_listener.this["https"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + certificate_arn                                                       = "arn:aws:acm:us-east-1:905418344519:certificate/0316475e-0d88-4812-901c-0e2b51d26a1e"
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 443
      + protocol                                                              = "HTTPS"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
      + routing_http_response_access_control_max_age_header_value             = (known after apply)
      + routing_http_response_content_security_policy_header_value            = (known after apply)
      + routing_http_response_server_enabled                                  = (known after apply)
      + routing_http_response_strict_transport_security_header_value          = (known after apply)
      + routing_http_response_x_content_type_options_header_value             = (known after apply)
      + routing_http_response_x_frame_options_header_value                    = (known after apply)
      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
      + tags                                                                  = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                              = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tcp_idle_timeout_seconds                                              = (known after apply)

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.alb.aws_lb_target_group.this["default"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "1"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "true"
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 80
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-01e178fdba62c75fb"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 10
          + matcher             = "200"
          + path                = "/"
          + port                = "traffic-port"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 2
        }
    }

  # module.alb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for bb-data-science-genai-llm application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bb-data-science-genai-llm-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = "vpc-01e178fdba62c75fb"
    }

  # module.alb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["0_0_0_0_0_443"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow public access"
      + from_port              = 443
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 443
    }

  # module.alb.aws_vpc_security_group_ingress_rule.this["0_0_0_0_0_80"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "Allow public access"
      + from_port              = 80
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "Environment"           = "data-science"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 80
    }

  # module.ecr_repositories.aws_ecr_repository.this[0] will be created
  + resource "aws_ecr_repository" "this" {
      + arn                  = (known after apply)
      + force_delete         = true
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "bb-data-science-genai-llm-rag-bedrock-demo"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + encryption_configuration {
          + encryption_type = "AES256"
          + kms_key         = (known after apply)
        }

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.ecr_repositories.aws_ecr_repository_policy.this[0] will be created
  + resource "aws_ecr_repository_policy" "this" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "ecr:ListTagsForResource",
                          + "ecr:ListImages",
                          + "ecr:GetRepositoryPolicy",
                          + "ecr:GetLifecyclePolicyPreview",
                          + "ecr:GetLifecyclePolicy",
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:DescribeRepositories",
                          + "ecr:DescribeImages",
                          + "ecr:DescribeImageScanFindings",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::905418344519:root"
                        }
                      + Sid       = "PrivateReadOnly"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + registry_id = (known after apply)
      + repository  = "bb-data-science-genai-llm-rag-bedrock-demo"
    }

  # module.ecs_cluster.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/bb-data-science-genai-llm-rag-bedrock-cluster"
      + name_prefix       = (known after apply)
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all          = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster.this[0] will be created
  + resource "aws_ecs_cluster" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + name     = "bb-data-science-genai-llm-rag-bedrock-cluster"
      + tags     = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }

      + configuration {
          + execute_command_configuration {
              + logging = "DEFAULT"
            }
        }

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # module.ecs_cluster.aws_ecs_cluster_capacity_providers.this[0] will be created
  + resource "aws_ecs_cluster_capacity_providers" "this" {
      + capacity_providers = [
          + "FARGATE",
        ]
      + cluster_name       = "bb-data-science-genai-llm-rag-bedrock-cluster"
      + id                 = (known after apply)

      + default_capacity_provider_strategy {
          + base              = 0
          + capacity_provider = "FARGATE"
          + weight            = 100
        }
    }

  # module.ecs_service.data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "bb-data-science-genai-llm-rag-bedrock"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.ecs_service.aws_ecs_service.this[0] will be created
  + resource "aws_ecs_service" "this" {
      + availability_zone_rebalancing      = "DISABLED"
      + cluster                            = (known after apply)
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 66
      + desired_count                      = 1
      + enable_ecs_managed_tags            = true
      + enable_execute_command             = true
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "bb-data-science-genai-llm-rag-bedrock"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags                               = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all                           = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + task_definition                    = (known after apply)
      + triggers                           = (known after apply)
      + wait_for_steady_state              = false

      + load_balancer {
          + container_name   = "demo"
          + container_port   = 8080
          + target_group_arn = (known after apply)
        }

      + network_configuration {
          + assign_public_ip = false
          + security_groups  = (known after apply)
          + subnets          = [
              + "subnet-0879ec2972f28cc03",
              + "subnet-0ae4e4874034d9346",
            ]
        }

      + timeouts {}
    }

  # module.ecs_service.aws_ecs_task_definition.this[0] will be created
  + resource "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "1024"
      + enable_fault_injection   = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = "bb-data-science-genai-llm-rag-bedrock"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags                     = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all                 = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + task_role_arn            = (known after apply)
      + track_latest             = false

      + runtime_platform {
          + cpu_architecture        = "X86_64"
          + operating_system_family = "LINUX"
        }
    }

  # module.ecs_service.aws_iam_policy.task_exec[0] will be created
  + resource "aws_iam_policy" "task_exec" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Task execution role IAM policy"
      + id               = (known after apply)
      + name             = "bb-data-science-genai-llm-rag-bedrock-task-exec-role"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "Logs"
                    },
                  + {
                      + Action   = [
                          + "ecr:GetDownloadUrlForLayer",
                          + "ecr:GetAuthorizationToken",
                          + "ecr:BatchGetImage",
                          + "ecr:BatchCheckLayerAvailability",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECR"
                    },
                  + {
                      + Action   = "secretsmanager:GetSecretValue"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:secretsmanager:*:*:secret:*"
                      + Sid      = "GetSecrets"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
    }

  # module.ecs_service.aws_iam_role.task_exec[0] will be created
  + resource "aws_iam_role" "task_exec" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTaskExecutionAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Task execution role for bb-data-science-genai-llm-rag-bedrock-task-exec-role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bb-data-science-genai-llm-rag-bedrock-task-exec-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_service.aws_iam_role.tasks[0] will be created
  + resource "aws_iam_role" "tasks" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + ArnLike      = {
                              + "aws:SourceArn" = "arn:aws:ecs:us-east-1:905418344519:*"
                            }
                          + StringEquals = {
                              + "aws:SourceAccount" = "905418344519"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = "ECSTasksAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bb-data-science-genai-llm-rag-bedrock-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "data-science"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.ecs_service.aws_iam_role_policy.tasks[0] will be created
  + resource "aws_iam_role_policy" "tasks" {
      + id          = (known after apply)
      + name        = "bb-data-science-genai-llm-rag-bedrock-task-role"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "ECSExec"
                    },
                  + {
                      + Action   = [
                          + "bedrock:InvokeModelWithResponseStream",
                          + "bedrock:InvokeModel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.ecs_service.aws_iam_role_policy_attachment.task_exec[0] will be created
  + resource "aws_iam_role_policy_attachment" "task_exec" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bb-data-science-genai-llm-rag-bedrock-task-exec-role"
    }

  # module.ecs_service.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "bb-data-science-genai-llm-rag-bedrock-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "data-science"
          + "Name"        = "bb-data-science-genai-llm-rag-bedrock"
          + "Terraform"   = "true"
        }
      + tags_all               = {
          + "Environment" = "data-science"
          + "Name"        = "bb-data-science-genai-llm-rag-bedrock"
          + "Terraform"   = "true"
        }
      + vpc_id                 = "vpc-01e178fdba62c75fb"
    }

  # module.ecs_service.aws_security_group_rule.this["alb_ingress"] will be created
  + resource "aws_security_group_rule" "this" {
      + description              = "Service port"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.ecs_service.aws_security_group_rule.this["egress_all"] will be created
  + resource "aws_security_group_rule" "this" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.iam_assumable_role_ecs_opensearch.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
              + "sts:TagSession",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "AWS"
            }
          + principals {
              + identifiers = []
              + type        = "Service"
            }
        }
    }

  # module.iam_assumable_role_ecs_opensearch.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "ecs-opensearch-serverless-access"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.iam_assumable_role_ecs_opensearch.aws_iam_role_policy_attachment.custom[0] will be created
  + resource "aws_iam_role_policy_attachment" "custom" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "ecs-opensearch-serverless-access"
    }

  # module.secrets.aws_secretsmanager_secret.sm["demo"] will be created
  + resource "aws_secretsmanager_secret" "sm" {
      + arn                            = (known after apply)
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + name                           = (known after apply)
      + name_prefix                    = "/data-science/genai-llm-rag-demo"
      + policy                         = (known after apply)
      + recovery_window_in_days        = 0
      + tags_all                       = (known after apply)
    }

  # module.secrets.aws_secretsmanager_secret_version.sm-svu["demo"] will be created
  + resource "aws_secretsmanager_secret_version" "sm-svu" {
      + arn                  = (known after apply)
      + has_secret_string_wo = (known after apply)
      + id                   = (known after apply)
      + secret_id            = (known after apply)
      + secret_string        = (sensitive value)
      + version_id           = (known after apply)
      + version_stages       = (known after apply)
    }

Plan: 38 to add, 0 to change, 0 to destroy.



Saved the plan to: default.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "default.tfplan"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d data-science/us-east-1/genai-llm-rag-bedrock-full
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.binbash.com.ar:4141/lock?id=binbashar%252Fle-tf-infra-aws%252Fdata-science%252Fus-east-1%252Fgenai-llm-rag-bedrock-full%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d data-science/us-east-1/genai-llm-rag-bedrock-full
  ```
Plan: 38 to add, 0 to change, 0 to destroy.

---
### 2. dir: `data-science/us-east-1/genai-llm-rag-bedrock-poc` workspace: `default`
<details><summary>Show Output</summary>

```diff
[22:06:13.404] INFO     Checking for local docker image, tag:                   
                        1.6.2-tofu-0.3.0-0-0...                                 
[22:06:13.412] INFO     ✔ OK                                                    
                                                                                
data.terraform_remote_state.ssl_cert: Reading...
data.terraform_remote_state.ssl_cert: Read complete after 1s
data.terraform_remote_state.shared-dns: Reading...
data.terraform_remote_state.vpc: Reading...
module.ecr_lifecycle_rule_default_policy_bycount.data.template_file.lifecycle_policy_imageCountMoreThan_untagged_or_any[0]: Reading...
module.ecr_lifecycle_rule_default_policy_bycount.data.template_file.lifecycle_policy_imageCountMoreThan_untagged_or_any[0]: Read complete after 0s [id=ef4a9107bd2316a4816fb9e662bbbba1eeb72fbb49fb3124b222343b20996765]
data.terraform_remote_state.shared-dns: Read complete after 0s
data.terraform_remote_state.vpc: Read complete after 0s
module.ecs_service.data.aws_iam_policy_document.tasks[0]: Reading...
module.ecs_service.data.aws_partition.current: Reading...
module.ecr_repositories.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Reading...
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Reading...
module.ecr_repositories.data.aws_partition.current: Reading...
module.alb.data.aws_partition.current: Reading...
module.ecr_repositories.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.tasks[0]: Read complete after 0s [id=2139823801]
module.ecs_service.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Reading...
module.alb.data.aws_partition.current: Read complete after 0s [id=aws]
module.ecs_service.data.aws_iam_policy_document.task_exec[0]: Read complete after 0s [id=635943167]
module.ecs_service.data.aws_region.current: Reading...
module.ecs_service.data.aws_caller_identity.current: Read complete after 0s [id=905418344519]
module.ecs_service.data.aws_iam_policy_document.task_exec_assume[0]: Read complete after 0s [id=2291109037]
module.ecr_repositories.data.aws_caller_identity.current: Read complete after 0s [id=905418344519]
module.ecr_repositories.data.aws_iam_policy_document.repository[0]: Reading...
module.ecs_service.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs_service.data.aws_subnet.this[0]: Reading...
module.ecr_repositories.data.aws_iam_policy_document.repository[0]: Read complete after 0s [id=942915339]
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Reading...
module.ecs_service.data.aws_iam_policy_document.tasks_assume[0]: Read complete after 0s [id=3497006181]
module.ecs_service.module.container_definition["demo"].data.aws_region.current: Reading...
module.ecs_service.module.container_definition["demo"].data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs_service.data.aws_subnet.this[0]: Read complete after 0s [id=subnet-0ae4e4874034d9346]

OpenTofu used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

OpenTofu will perform the following actions:

  # aws_iam_openid_connect_provider.aws_github_oidc will be created
  + resource "aws_iam_openid_connect_provider" "aws_github_oidc" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags_all        = (known after apply)
      + thumbprint_list = [
          + "6938fd4d98bab03faadb97b34396831e3780aea1",
          + "1c58a3a8518e8759bf075b76b750d4f2df264fcd",
          + "f879abce0008e4eb126e0097e46620f5aaae26ad",
        ]
      + url             = "https://token.actions.githubusercontent.com"
    }

  # aws_iam_policy.github_actions_oidc will be created
  + resource "aws_iam_policy" "github_actions_oidc" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Github OIDC integration for Github Actions"
      + id               = (known after apply)
      + name             = "bb-data-science-genai-llm-rag-bedrock-github-actions-oidc"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Environment" = "data-science"
          + "Layer"       = "genai-llm-rag-bedrock-poc"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
      + tags_all         = {
          + "Environment" = "data-science"
          + "Layer"       = "genai-llm-rag-bedrock-poc"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
    }

  # aws_iam_role.github_actions_role will be created
  + resource "aws_iam_role" "github_actions_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + description           = "Github OIDC integration for Github Actions"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "bb-data-science-genai-llm-rag-bedrock-github-actions-oidc"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "data-science"
          + "Layer"       = "genai-llm-rag-bedrock-poc"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
      + tags_all              = {
          + "Environment" = "data-science"
          + "Layer"       = "genai-llm-rag-bedrock-poc"
          + "Name"        = "github-oidc-workflows"
          + "Terraform"   = "true"
        }
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.github_actions_oidc will be created
  + resource "aws_iam_role_policy_attachment" "github_actions_oidc" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "bb-data-science-genai-llm-rag-bedrock-github-actions-oidc"
    }

  # aws_route53_record.priv_app_aws will be created
  + resource "aws_route53_record" "priv_app_aws" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "demo-genai.binbash.co"
      + type            = "A"
      + zone_id         = "Z07094013VFYCFPMVTXMM"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.alb.aws_lb.this[0] will be created
  + resource "aws_lb" "this" {
      + arn                                                          = (known after apply)
      + arn_suffix                                                   = (known after apply)
      + client_keep_alive                                            = 3600
      + desync_mitigation_mode                                       = "defensive"
      + dns_name                                                     = (known after apply)
      + drop_invalid_header_fields                                   = true
      + enable_deletion_protection                                   = false
      + enable_http2                                                 = true
      + enable_tls_version_and_cipher_suite_headers                  = false
      + enable_waf_fail_open                                         = false
      + enable_xff_client_port                                       = false
      + enable_zonal_shift                                           = false
      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
      + id                                                           = (known after apply)
      + idle_timeout                                                 = 60
      + internal                                                     = false
      + ip_address_type                                              = (known after apply)
      + load_balancer_type                                           = "application"
      + name                                                         = "bb-data-science-genai-llm"
      + name_prefix                                                  = (known after apply)
      + preserve_host_header                                         = false
      + security_groups                                              = (known after apply)
      + subnets                                                      = [
          + "subnet-0a966549cc7baeb8a",
          + "subnet-0eca343a6aadc25c0",
        ]
      + tags                                                         = {
          + "Environment"           = "data-science"
          + "Layer"                 = "genai-llm-rag-bedrock-poc"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                                                     = {
          + "Environment"           = "data-science"
          + "Layer"                 = "genai-llm-rag-bedrock-poc"
          + "Terraform"             = "true"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                                                       = (known after apply)
      + xff_header_processing_mode                                   = "append"
      + zone_id                                                      = (known after apply)

      + timeouts {}
    }

  # module.alb.aws_lb_listener.this["http"] will be created
  + resource "aws_lb_listener" "this" {
      + arn                                                                   = (known after apply)
      + id                                                                    = (known after apply)
      + load_balancer_arn                                                     = (known after apply)
      + port                                                                  = 80
      + protocol                                                              = "HTTP"
      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
      + routing_http_response_access_control_expose_headers_header_value      = (
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.